Repository: elevateott/Elevate-OTT-Platform
Catalog: src/ElevateOTT.BackendResources/Resource.*.resx
Languages: es_es, hi_in, zh_cn

source: User has been updated successfully without updating his/her roles as the user is static type.
es_es: El usuario se ha actualizado correctamente sin actualizar sus roles, ya que el usuario es de tipo estático.
hi_in: उपयोगकर्ता को अपनी भूमिकाओं को अपडेट किए बिना सफलतापूर्वक अपडेट किया गया है क्योंकि उपयोगकर्ता स्थिर प्रकार है।
zh_cn: 用户已成功更新，但未更新其角色，因为用户是静态类型。

source: User Id is required.
es_es: Se requiere ID de usuario.
hi_in: यूजर आईडी की जरूरत है।
zh_cn: 需要用户 ID。

source: User permissions have been updated successfully.
es_es: Los permisos de usuario se han actualizado correctamente.
hi_in: उपयोगकर्ता अनुमतियों को सफलतापूर्वक अपडेट किया गया है।
zh_cn: 用户权限已成功更新。

# User_with_Id_deleted
source: User with ID '{0}' has been deleted.
es_es: El usuario con ID '{0}' ha sido eliminado.
hi_in: आईडी '{0}' वाले उपयोगकर्ता को हटा दिया गया है.
zh_cn: 具有 ID"{0}"的用户已被删除。

# User_with_Id_UserId_logged_in_with_2Fa
source: User with ID '{0}' logged in with Two-Factor Authentication.
es_es: El usuario con ID '{0}' inició sesión con la autenticación de dos factores.
hi_in: आईडी '{0}' वाले उपयोगकर्ता ने टू-फैक्टर ऑथेंटिकेशन के साथ लॉग इन किया।
zh_cn: 具有 ID"{0}"的用户通过双重身份验证登录。

# value_cannot_be_null
source: {0} cannot be null
es_es: {0} no puede ser nulo
hi_in: {0} शून्य नहीं हो सकता
zh_cn: {0}不能无效

source: Verification code is invalid.
es_es: El código de verificación no es válido.
hi_in: सत्यापन कोड अमान्य है।
zh_cn: 验证代码无效。

# Verification_email_has_been_sent
source: Verification email has been sent. Please check your email.
es_es: Se ha enviado un correo electrónico de verificación. Por favor, revise su correo electrónico.
hi_in: वेरिफिकेशन ईमेल भेजा गया है। कृपया अपना ईमेल चेक करें।
zh_cn: 已发送验证电子邮件。请查看您的电子邮件。

source: Video
es_es: Vídeo

source: Weight is required.
es_es: Se requiere peso.
hi_in: वजन की आवश्यकता है।
zh_cn: 需要重量。

source: Your account is deactivated. Please contact your administrator.
es_es: Su cuenta está desactivada. Póngase en contacto con su administrador.
hi_in: आपका खाता निष्क्रिय कर दिया जाता है. कृपया अपने प्रशासक से संपर्क करें।
zh_cn: 您的帐户已停用。请联系您的管理员。

source: Your authenticator app has been verified.
es_es: Se ha verificado la aplicación de autenticación.
hi_in: आपका प्रमाणक ऐप सत्यापित कर लिया गया है।
zh_cn: 您的身份验证器应用已验证。

# Your_authenticator_app_key_has_been_reset
source: Your authenticator app key has been reset, you will need to configure your authenticator app using the new key.
es_es: La clave de la aplicación de autenticación se ha restablecido, deberá configurar la aplicación de autenticación con la nueva clave.
hi_in: आपकी प्रमाणक ऐप कुंजी रीसेट की गई है, आपको नई कुंजी का उपयोग करके अपने प्रमाणक ऐप को कॉन्फ़िगर करना होगा।
zh_cn: 您的身份验证器应用密钥已重置，您将需要使用新密钥配置身份验证器应用。

source: Your email has been changed successfully.
es_es: Su correo electrónico se ha cambiado correctamente.
hi_in: आपका ईमेल सफलतापूर्वक बदल दिया गया है।
zh_cn: 您的电子邮件已成功更改。

source: Your email has been successfully changed.
es_es: Su correo electrónico se ha cambiado correctamente.
hi_in: आपका ईमेल सफलतापूर्वक बदल दिया गया है।
zh_cn: 您的电子邮件已成功更改。

source: Your email is unchanged.
es_es: Su correo electrónico no ha cambiado.
hi_in: आपका ईमेल अपरिवर्तित है।
zh_cn: 您的电子邮件保持不变。

source: Your password has been changed.
es_es: Su contraseña ha sido cambiada.
hi_in: आपका पासवर्ड बदल दिया गया है।
zh_cn: 您的密码已更改。

source: Your password has been reset.
es_es: Su contraseña ha sido restablecida.
hi_in: आपका पासवर्ड रीसेट कर दिया गया है।
zh_cn: 您的密码已重置。

source: Your password has been set.
es_es: Se ha establecido su contraseña.
hi_in: आपका पासवर्ड सेट कर दिया गया है।
zh_cn: 您的密码已设置。

# You_are_forbidden
source: You are forbidden to access {0}.
es_es: Está prohibido acceder a {0}.
hi_in: आपको {0} तक पहुंचने के लिए मना किया जाता है।
zh_cn: 您被禁止访问{0}。

# You_are_locked_out
source: You're locked out.
es_es: Estás bloqueado.
hi_in: आप बाहर बंद कर रहे हैं।
zh_cn: 你被锁在门外了

# You_are_not_authorized
source: You are not authorized to access {0}.
es_es: No está autorizado a acceder a {0}.
hi_in: आप {0} तक पहुंचने के लिए अधिकृत नहीं हैं।
zh_cn: 您未获授权访问{0}。

source: You have generated new recovery codes.
es_es: Ha generado nuevos códigos de recuperación.
hi_in: आपने नए रिकवरी कोड जेनरेट किए हैं।
zh_cn: 您已生成新的恢复代码。

source: You have successfully created a new account.
es_es: Ha creado correctamente una nueva cuenta.
hi_in: आपने सफलतापूर्वक एक नया खाता बनाया है।
zh_cn: 您已成功创建了一个新帐户。
