Repository: elevateott/Elevate-OTT-Platform
Catalog: src/ElevateOTT.BackendResources/Resource.*.resx
Languages: es_es, hi_in, zh_cn

source: Access token timespan cannot be null.
es_es: El tiempo del token de acceso no puede ser nulo.
hi_in: एक्सेस टोकन टाइमपैन शून्य नहीं हो सकता है।
zh_cn: 访问令牌时限不能为空。

source: Access token timespan is required.
es_es: Se requiere un margen de tiempo del token de acceso.
hi_in: टोकन टाइमपैन तक पहुंच की आवश्यकता है।
zh_cn: 需要访问令牌时间跨度。

source: Allowed username characters are required.
es_es: Se requieren caracteres de nombre de usuario permitidos.
hi_in: अनुमति उपयोगकर्ता नाम वर्ण की आवश्यकता है।
zh_cn: 需要允许的用户名字符。

source: An unknown failure has occurred.
es_es: Se ha producido un error desconocido.
hi_in: एक अज्ञात विफलता हुई है ।
zh_cn: 发生了未知故障。

source: Applicant has been created successfully
es_es: El solicitante ha sido creado con éxito
hi_in: आवेदक सफलतापूर्वक बनाया गया है
zh_cn: 申请人已创建成功

source: Applicant has been deleted successfully.
es_es: El solicitante se ha eliminado correctamente.
hi_in: आवेदक को सफलतापूर्वक हटा दिया गया है।
zh_cn: 申请人已成功删除。

source: Applicant has been updated successfully.
es_es: El solicitante ha sido actualizado con éxito.
hi_in: आवेदक को सफलतापूर्वक अपडेट किया गया है।
zh_cn: 申请人已成功更新。

source: Author has been created successfully.
es_es: ¿ha sido creado con éxito!

source: Author has been deleted successfully.
es_es: ha sido eliminado correctamente

source: Author has been updated successfully.
es_es: ha sido actualizado con éxito

source: A user with this login already exists.
es_es: Ya existe un usuario con este inicio de sesión.
hi_in: इस लॉगिन के साथ एक उपयोगकर्ता पहले से ही मौजूद है।
zh_cn: 已存在此登录的用户。

# Cannot_disable_2FA_for_user_with_Id
source: Cannot disable Two-Factor Authentication for user with ID '{0}' as it's not currently enabled.
es_es: No se puede deshabilitar la autenticación de dos factores para el usuario con ID '{0}', ya que actualmente no está habilitada.
hi_in: आईडी '{0}' वाले उपयोगकर्ता के लिए टू-फैक्टर प्रमाणीकरण को अक्षम नहीं कर सकते क्योंकि यह वर्तमान में सक्षम नहीं है।
zh_cn: 不能禁用具有 ID"{0}"的用户的双重身份验证，因为它目前尚未启用。

# Cannot_generate_recovery_codes
source: Cannot generate recovery codes for username '{0}' as they do not have Two-Factor Authentication enabled.
es_es: No se pueden generar códigos de recuperación para el nombre de usuario '{0}', ya que no tienen habilitada la autenticación de dos factores.
hi_in: उपयोगकर्ता नाम '{0}' के लिए रिकवरी कोड उत्पन्न नहीं कर सकते क्योंकि उनके पास टू-फैक्टर ऑथेंटिकेशन सक्षम नहीं है।
zh_cn: 不能生成用户名"{0}"的恢复代码，因为它们没有启用双重身份验证。

source: Code is required.
es_es: Se requiere código.
hi_in: कोड की आवश्यकता है।
zh_cn: 需要代码。

# Confirmation_link_to_change_email_has_been_sent
source: Confirmation link to change email has been sent. Please check your email.
es_es: Se ha enviado un enlace de confirmación para cambiar el correo electrónico. Por favor, revise su correo electrónico.
hi_in: ईमेल बदलने के लिए पुष्टि लिंक भेजा गया है। कृपया अपना ईमेल चेक करें।
zh_cn: 已发送更改电子邮件的确认链接。请查看您的电子邮件。

source: Confirm Password is required.
es_es: Se requiere confirmar contraseña.
hi_in: पुष्टि पासवर्ड की आवश्यकता है।
zh_cn: 需要确认密码。

source: Confirm your email
es_es: Confirma tu correo electrónico
hi_in: अपने ईमेल की पुष्टि करें
zh_cn: 确认您的电子邮件

source: Date of Birth is required
es_es: Se requiere fecha de nacimiento
hi_in: जन्म तिथि आवश्यक है
zh_cn: 需要出生日期

# Deletion_of_entity_failed
source: Deletion of entity "{0}" ({1}) failed. {2}.
es_es: Error al eliminar la entidad "{0}" ({1}). {2}.
hi_in: इकाई "{0}" ({1}) का विलोपन विफल रहा। {2}.
zh_cn: 删除实体"{0}"（{1}）失败。{2}.

# Email_is_already_taken
source: Email '{0}' is already taken.
es_es: El correo electrónico '{0}' ya está tomado.
hi_in: ईमेल '{0}' पहले से ही लिया जाता है।
zh_cn: 电子邮件"{0}"已被获取。

# Email_is_invalid
source: Email '{0}' is invalid.
es_es: El correo electrónico '{0}' no es válido.
hi_in: ईमेल '{0}' अमान्य है।
zh_cn: 电子邮件"{0}"无效。

# Entity_with_key_was_not_found
source: Entity "{0}" with key "{1}" was not found.
es_es: No se encontró la entidad "{0}" con la clave "{1}".
hi_in: प्रमुख "{1}" के साथ इकाई "{0}" नहीं मिली।
zh_cn: 未找到具有关键"{1}"的实体"{0}"。

source: Error changing user name.
es_es: Error al cambiar el nombre de usuario.
hi_in: उपयोगकर्ता नाम बदलने में त्रुटि।
zh_cn: 更改用户名的错误。

source: Error changing your user name.
es_es: Error al cambiar el nombre de usuario.
hi_in: आपके उपयोगकर्ता नाम को बदलने में त्रुटि।
zh_cn: 更改用户名的错误。

source: File has not been uploaded.
es_es: El archivo no se ha cargado.
hi_in: फाइल अपलोड नहीं की गई है।
zh_cn: 文件尚未上传。

source: File is empty.
es_es: El archivo está vacío.
hi_in: फाइल खाली है।
zh_cn: 文件是空的。

source: File storage settings have been updated successfully.
es_es: La configuración de almacenamiento de archivos se ha actualizado correctamente.
hi_in: फ़ाइल स्टोरेज सेटिंग को सफलतापूर्वक अपडेट किया गया है।
zh_cn: 文件存储设置已成功更新。

source: First name is required.
es_es: Se requiere nombre.
hi_in: पहले नाम की आवश्यकता है।
zh_cn: 需要名字。

source: Height is required.
es_es: Se requiere altura.
hi_in: ऊंचाई की आवश्यकता है।
zh_cn: 需要高度。

source: Identity settings have been updated successfully.
es_es: La configuración de identidad se ha actualizado correctamente.
hi_in: पहचान सेटिंग्स को सफलतापूर्वक अपडेट किया गया है।
zh_cn: 身份设置已成功更新。

source: Incorrect password.
es_es: Contraseña incorrecta.
hi_in: गलत पासवर्ड।
zh_cn: 密码不正确。

source: Invalid applicant ID.
es_es: Identificación de solicitante no válida.
hi_in: अमान्य आवेदक आईडी।
zh_cn: 无效申请人 ID。

source: Invalid authenticator code entered.
es_es: Se ha introducido un código de autenticación no válido.
hi_in: अमान्य प्रमाणक कोड दर्ज किया गया।
zh_cn: 输入无效身份验证器代码。

source: Invalid author ID.
es_es: ID de autor no válido.

source: Invalid client request.
es_es: Solicitud de cliente no válida.
hi_in: अमान्य ग्राहक अनुरोध।
zh_cn: 无效的客户请求。

source: Invalid login attempt.
es_es: Intento de inicio de sesión no válido.
hi_in: अमान्य लॉगिन प्रयास।
zh_cn: 无效登录尝试。

source: Invalid recovery code entered.
es_es: Se ha introducido un código de recuperación no válido.
hi_in: अमान्य वसूली कोड दर्ज किया गया।
zh_cn: 输入无效恢复代码。

source: Invalid report Id.
es_es: Identificador de informe no válido.
hi_in: अमान्य रिपोर्ट Id.
zh_cn: 报告 ID 无效。

source: Invalid role ID.
es_es: ID de rol no válido.
hi_in: अमान्य रोल आईडी।
zh_cn: 无效角色 ID。

source: Invalid tenant ID.
es_es: ¡ID de inquilino no válido!

source: Invalid tenant name.
es_es: Nombre de inquilino no válido.
hi_in: अमान्य किरायेदार का नाम।
zh_cn: 无效租户名称。

source: Invalid token.
es_es: Token no válido.
hi_in: अमान्य टोकन।
zh_cn: 无效令牌。

source: Invalid user ID.
es_es: ID de usuario no válido.
hi_in: अमान्य यूजर आईडी।
zh_cn: 无效用户 ID。

source: Job title is required.
es_es: Se requiere título de trabajo.
hi_in: नौकरी शीर्षक की आवश्यकता है ।
zh_cn: 需要职称。

source: Last name is required
es_es: Se requiere apellido
hi_in: अंतिम नाम आवश्यक है
zh_cn: 需要姓氏

source: Lockout is not enabled for this user.
es_es: El bloqueo no está habilitado para este usuario.
hi_in: इस उपयोगकर्ता के लिए तालाबंदी सक्षम नहीं है।
zh_cn: 此用户无法启用锁定。

source: Maximum allowed number of attachments must not exceed 3.
es_es: El número máximo permitido de archivos adjuntos no debe exceder de 3.
hi_in: अटैचमेंट की अधिकतम अनुमेदित संख्या 3 से अधिक नहीं होनी चाहिए।
zh_cn: 允许的最大附件数量不得超过 3。

source: Method cannot be null.
es_es: El método no puede ser null.
hi_in: विधि शून्य नहीं हो सकती।
zh_cn: 方法不能无效。

source: Minimum allowed number of attachments must be at least 1.
es_es: El número mínimo permitido de archivos adjuntos debe ser de al menos 1.
hi_in: अटैचमेंट की न्यूनतम अनुमेई संख्या कम से कम 1 होनी चाहिए।
zh_cn: 允许的附件的最小数量必须至少为 1。

source: New password is required.
es_es: Se requiere una nueva contraseña.
hi_in: नए पासवर्ड की आवश्यकता है।
zh_cn: 需要新的密码。

source: New password must be at least 6 characters.
es_es: La nueva contraseña debe tener al menos 6 caracteres.
hi_in: नया पासवर्ड कम से कम 6 वर्ण होना चाहिए।
zh_cn: 新密码必须至少为 6 个字符。

source: New password must not exceed 200 characters.
es_es: La nueva contraseña no debe exceder los 200 caracteres.
hi_in: नया पासवर्ड 200 वर्णों से अधिक नहीं होना चाहिए।
zh_cn: 新密码不得超过 200 个字符。

source: N/A
es_es: ¡No disponible!
hi_in: उपलब्ध नहीं है
zh_cn: 不可用

source: Old password is required.
es_es: Se requiere contraseña antigua.
hi_in: पुराने पासवर्ड की आवश्यकता है।
zh_cn: 需要旧密码。

source: Only those between the ages of 18 and 28 are allowed for enlisting.
es_es: Solo aquellos entre las edades de 18 y 28 años pueden alistarse.
hi_in: केवल 18 और 28 की उम्र के बीच के लोगों को सूचीबद्ध करने की अनुमति है ।
zh_cn: 只有18至28岁的人才能入伍。

source: Only those whose BMI between 18.5 and 24.9 are allowed for enlisting.
es_es: Solo aquellos cuyo IMC entre 18.5 y 24.9 están permitidos para alistarse.
hi_in: केवल उन लोगों को सूचीबद्ध करने की अनुमति है जिनका बीएमआई १८.५ और २४.९ के बीच है ।
zh_cn: 只有体重指数在18.5至24.9之间的人才能入伍。

source: Only those whose heights between 100 and 250 with normal BMI are allowed for enlisting.
es_es: Solo aquellos cuyas alturas entre 100 y 250 con un IMC normal están permitidas para alistarse.
hi_in: केवल उन लोगों को सूचीबद्ध करने की अनुमति है जिनकी सामान्य बीएमआई के साथ 100 और 250 के बीच की ऊंचाई को सूचीबद्ध करने की अनुमति है।
zh_cn: 只有身高在 100 到 250 之间且体重指数正常的人才能入伍。

source: Only those who weigh between 50 and 200 with normal BMI are allowed for enlisting.
es_es: Solo aquellos que pesan entre 50 y 200 con un IMC normal pueden alistarse.
hi_in: केवल उन लोगों को सूचीबद्ध करने की अनुमति है जो सामान्य बीएमआई के साथ ५० और २०० के बीच वजन करते हैं ।
zh_cn: 只有体重在50到200岁之间，体重指数正常的人才能入伍。

# Optimistic_concurrency_failure
source: Optimistic concurrency failure, object has been modified.
es_es: Fallo de simultaneidad optimista, el objeto ha sido modificado.
hi_in: आशावादी सहमति विफलता, वस्तु को संशोधित किया गया है ।
zh_cn: 乐观并发故障，对象已修改。

# Passwords_must_be_at_least_length_characters
source: Passwords must be at least {0} characters.
es_es: Las contraseñas deben tener al menos {0} caracteres.
hi_in: पासवर्ड कम से कम {0} वर्ण होना चाहिए।
zh_cn: 密码必须至少是{0}字符。

# Passwords_must_have_at_least_one_digit
source: Passwords must have at least one digit ('0'-'9').
es_es: Las contraseñas deben tener al menos un dígito ('0'-'9').
hi_in: पासवर्ड में कम से कम एक अंक ('0'-'9') होना चाहिए।
zh_cn: 密码必须至少有一个数字（'0'-'9'）。

# Passwords_must_have_at_least_one_lowercase
source: Passwords must have at least one lowercase ('a'-'z').
es_es: Las contraseñas deben tener al menos una minúscula ('a'-'z').
hi_in: पासवर्ड में कम से कम एक लोअरकेस ('ए'-ज़') होना चाहिए।
zh_cn: 密码必须至少有一个小写（'a'-'z'）。

source: Passwords must have at least one non alphanumeric character.
es_es: Las contraseñas deben tener al menos un carácter no alfanumérico.
hi_in: पासवर्ड में कम से कम एक गैर अल्फान्यूमेरिक चरित्र होना चाहिए।
zh_cn: 密码必须至少有一个非字母数字字符。

# Passwords_must_have_at_least_one_uppercase
source: Passwords must have at least one uppercase ('A'-'Z').
es_es: Las contraseñas deben tener al menos una mayúscula ('A'-'Z').
hi_in: पासवर्ड में कम से कम एक अपरकेस ('ए'-जेड') होना चाहिए।
zh_cn: 密码必须至少有一个大写字母（'A'-'Z'）。

source: Password cannot contain 'password'.
es_es: La contraseña no puede contener 'contraseña'.
hi_in: पासवर्ड में 'पासवर्ड' नहीं हो सकता है।
zh_cn: 密码不能包含"密码"。

source: Password cannot contain username.
es_es: La contraseña no puede contener nombre de usuario.
hi_in: पासवर्ड में उपयोगकर्ता नाम नहीं हो सकता है।
zh_cn: 密码不能包含用户名。

source: Password is required.
es_es: Se requiere contraseña.
hi_in: पासवर्ड की आवश्यकता है।
zh_cn: 需要密码。

source: Password must be at least 6 characters.
es_es: La contraseña debe tener al menos 6 caracteres.
hi_in: पासवर्ड कम से कम 6 वर्ण होना चाहिए।
zh_cn: 密码必须至少为 6 个字符。

source: Password must not exceed 200 characters.
es_es: La contraseña no debe exceder los 200 caracteres.
hi_in: पासवर्ड 200 वर्णों से अधिक नहीं होना चाहिए।
zh_cn: 密码不得超过 200 个字符。

# Password_reset_link_was_sent
source: Password reset link was sent. Please check your email.
es_es: Se envió el enlace de restablecimiento de contraseña. Por favor, revise su correo electrónico.
hi_in: पासवर्ड रीसेट लिंक भेजा गया था। कृपया अपना ईमेल चेक करें।
zh_cn: 已发送密码重置链接。请查看您的电子邮件。

source: Phone number is_required.
es_es: ¡Se requiere el número de teléfono!
hi_in: फोन नंबर आवश्यक है।!
zh_cn: 电话号码是必需的。！

# Please_confirm_your_account_by_clicking_here
source: Please confirm your account by <a href='{0}'>clicking here</a>.
es_es: Por favor, confirme su cuenta <a href='{0}'>haciendo clic aquí.</a>
hi_in: कृपया <a href='{0}'>यहां क्लिक करके</a>अपने खाते की पुष्टि करें ।
zh_cn: 请 <a href='{0}'>点击这里</a>确认您的帐户。

source: Please confirm your email.
es_es: Por favor, confirme su correo electrónico.
hi_in: कृपया अपने ईमेल की पुष्टि करें।
zh_cn: 请确认您的电子邮件。

# Please_reset_your_password_by_clicking_here
source: Please reset your password by <a href='{0}'>clicking here</a>.
es_es: Por favor, restablezca su contraseña <a href='{0}'>haciendo clic aquí.</a>
hi_in: कृपया <a href='{0}'>यहां क्लिक करके</a>अपना पासवर्ड रीसेट करें ।
zh_cn: 请 <a href='{0}'>点击这里</a>重置密码。

source: Please specify the application tenant mode.
es_es: Especifique el modo de inquilino de la aplicación.
hi_in: आवेदन किरायेदार मोड निर्दिष्ट करें।
zh_cn: 请指定应用程序租户模式。

source: Profile picture is required.
es_es: Se requiere foto de perfil.
hi_in: प्रोफाइल पिक्चर की आवश्यकता है।
zh_cn: 需要配置文件图片。

source: Recovery Code is required.
es_es: Se requiere código de recuperación.
hi_in: रिकवरी कोड की आवश्यकता है।
zh_cn: 需要恢复代码。

source: Recovery Code Redemption Failed
es_es: Error de canje del código de recuperación
hi_in: रिकवरी कोड रिडेम्पशन फेल
zh_cn: 恢复代码兑换失败

source: Reference name is required.
es_es: El nombre es obligatorio.
hi_in: नाम आवश्यक है!
zh_cn: 名称是必填项！

source: Refresh token timespan cannot be null.
es_es: El tiempo de actualización del token no puede ser nulo.
hi_in: ताज़ा टोकन टाइमपैन शून्य नहीं हो सकता है।
zh_cn: 刷新令牌时间跨度不能为空。

source: Refresh token timespan is required.
es_es: Se requiere un tiempo de actualización del token.
hi_in: ताज़ा टोकन टाइमपैन की आवश्यकता है।
zh_cn: 需要刷新令牌时间跨度。

source: Refresh token timespan must be greater than access token expiry time.
es_es: El intervalo de tiempo de actualización del token debe ser mayor que el tiempo de caducidad del token de acceso.
hi_in: ताज़ा टोकन टाइमपैन एक्सेस टोकन समाप्ति समय से अधिक होना चाहिए।
zh_cn: 刷新令牌时跨度必须大于访问令牌到期时间。

# Repeated_Ones_are_not_valid_Social_security_number
source: 111111111 is not a valid Social security number.
es_es: 111111111 no es un número de Seguro Social válido.
hi_in: 111111111 एक वैध सामाजिक सुरक्षा संख्या नहीं है।
zh_cn: 111111111不是有效的社会保险号码。

# Repeated_Threes_are_not_valid_Social_security_number
source: 333333333 is not a valid Social security number.
es_es: 333333333 no es un número de Seguro Social válido.
hi_in: 333333333 एक वैध सामाजिक सुरक्षा संख्या नहीं है।
zh_cn: 333333333不是有效的社会保险号码。

source: Reset your password
es_es: Restablecer la contraseña
hi_in: अपना पासवर्ड रीसेट करें
zh_cn: 重置密码

source: Role has been created successfully.
es_es: El rol se ha creado correctamente.
hi_in: भूमिका सफलतापूर्वक बनाई गई है ।
zh_cn: 角色已创建成功。

source: Role has been deleted successfully.
es_es: El rol se ha eliminado correctamente.
hi_in: भूमिका को सफलतापूर्वक हटा दिया गया है।
zh_cn: 角色已成功删除。

source: Role has been updated successfully.
es_es: El rol se ha actualizado correctamente.
hi_in: भूमिका को सफलतापूर्वक अद्यतन किया गया है ।
zh_cn: 角色已成功更新。

# Role_name_is_already_taken
source: Role name '{0}' is already taken.
es_es: El nombre del rol '{0}' ya está tomado.
hi_in: रोल नाम '{0}' पहले से ही लिया गया है।
zh_cn: 角色名称"{0}"已被获取。

# Role_name_is_invalid
source: Role name '{0}' is invalid.
es_es: El nombre del rol '{0}' no es válido.
hi_in: रोल नाम '{0}' अमान्य है।
zh_cn: 角色名称"{0}"无效。

source: Role name is required.
es_es: Se requiere el nombre del rol.
hi_in: रोल नाम की आवश्यकता है।
zh_cn: 需要角色名称。

source: Social security number is required
es_es: Se requiere número de seguro social
hi_in: सामाजिक सुरक्षा संख्या की आवश्यकता है
zh_cn: 需要社会保险号码

source: Social security number must contain only 9-digits.
es_es: El número de seguro social debe contener solo 9 dígitos.
hi_in: सामाजिक सुरक्षा संख्या में केवल 9 अंक होने चाहिए ।
zh_cn: 社会保险号码必须只包含 9 位数字。

source: Social security number must not contain consecutive digits.
es_es: El número de seguro social no debe contener dígitos consecutivos.
hi_in: सामाजिक सुरक्षा संख्या में लगातार अंक नहीं होने चाहिए ।
zh_cn: 社会保险号码不得包含连续数字。

source: Surname is required.
es_es: Se requiere apellido.
hi_in: उपनाम की आवश्यकता है।
zh_cn: 需要姓氏。

source: Tenant has been created successfully.
es_es: El inquilino se ha creado correctamente.
hi_in: किरायेदार सफलतापूर्वक बनाया गया है।
zh_cn: 租户已成功创建。

source: The applicant is not found.
es_es: No se encuentra al solicitante.
hi_in: आवेदक नहीं मिला है।
zh_cn: 找不到申请人。

source: The author is not found.
es_es: ¡El autor no ha sido encontrado!

source: The password and confirmation password do not match.
es_es: La contraseña y la contraseña de confirmación no coinciden.
hi_in: पासवर्ड और कन्फर्मेशन पासवर्ड मेल नहीं खाता।
zh_cn: 密码和确认密码不匹配。

source: The specified role is already registered.
es_es: El rol especificado ya está registrado.
hi_in: निर्दिष्ट भूमिका पहले से ही पंजीकृत है।
zh_cn: 指定的角色已注册。

source: The specified role is already registered in the given tenant.
es_es: El rol especificado ya está registrado en el inquilino dado.
hi_in: निर्दिष्ट भूमिका पहले से ही दिए गए किरायेदार में पंजीकृत है।
zh_cn: 指定的角色已在给定租户中注册。

source: The specified username and email are already registered.
es_es: El nombre de usuario y el correo electrónico especificados ya están registrados.
hi_in: निर्दिष्ट उपयोगकर्ता नाम और ईमेल पहले से ही पंजीकृत हैं।
zh_cn: 指定的用户名和电子邮件已注册。

source: The specified username and email are already registered in the given tenant.
es_es: El nombre de usuario y el correo electrónico especificados ya están registrados en el inquilino dado.
hi_in: दिए गए किरायेदार में निर्दिष्ट उपयोगकर्ता नाम और ईमेल पहले से ही पंजीकृत हैं।
zh_cn: 指定的用户名和电子邮件已在给定租户中注册。

source: Token settings have been updated successfully.
es_es: La configuración del token se ha actualizado correctamente.
hi_in: टोकन सेटिंग्स को सफलतापूर्वक अपडेट किया गया है।
zh_cn: 令牌设置已成功更新。

source: Two factor authentication code is required.
es_es: Se requiere un código de autenticación de dos factores.
hi_in: दो कारक प्रमाणीकरण कोड की आवश्यकता है।
zh_cn: 需要两个因子身份验证代码。

source: Two factor authentication code must be at least 6 character long.
es_es: El código de autenticación de dos factores debe tener al menos 6 caracteres.
hi_in: दो कारक प्रमाणीकरण कोड कम से कम 6 चरित्र लंबा होना चाहिए।
zh_cn: 两个因素身份验证代码必须至少 6 字符长。

source: Two factor authentication code must not exceed 7 characters.
es_es: El código de autenticación de dos factores no debe exceder los 7 caracteres.
hi_in: दो कारक प्रमाणीकरण कोड 7 अक्षरों से अधिक नहीं होना चाहिए।
zh_cn: 两个因素身份验证代码不得超过 7 个字符。

# Two_factor_authentication_has_been_disabled
source: 2Fa has been disabled. You can reenable Two-Factor Authentication when you setup an authenticator app.
es_es: 2Fa ha sido deshabilitado. Puede volver a permitir la autenticación de dos factores al configurar una aplicación de autenticación.
hi_in: 2Fa को अक्षम कर दिया गया है। जब आप एक प्रमाणक ऐप सेटअप करते हैं तो आप टू-फैक्टर ऑथेंटिकेशन को फिर से तैयार कर सकते हैं।
zh_cn: 2Fa 已禁用。设置身份验证器应用时，您可以重新进行双重身份验证。

source: Two-factor authentication required.
es_es: Se requiere autenticación de dos factores.
hi_in: दो कारक प्रमाणीकरण की आवश्यकता है।
zh_cn: 需要双重身份验证。

source: Unable to create new tenant in single tenant mode.
es_es: No se puede crear un nuevo inquilino en modo de inquilino único.
hi_in: एकल किरायेदार मोड में नए किरायेदार बनाने में असमर्थ।
zh_cn: 无法在单个租户模式下创建新租户。

source: Unable to delete static role.
es_es: No se puede eliminar el rol estático.
hi_in: स्थिर भूमिका को हटाने में असमर्थ।
zh_cn: 无法删除静态角色。

source: Unable to delete static user.
es_es: No se puede eliminar el usuario estático.
hi_in: स्थिर उपयोगकर्ता को हटाने में असमर्थ।
zh_cn: 无法删除静态用户。

source: Unable to load applicant.
es_es: No se puede cargar el solicitante.
hi_in: आवेदक लोड करने में असमर्थ।
zh_cn: 无法加载申请人。

source: Unable to load author.
es_es: ¡No se puede cargar el autor!

source: Unable to load report.
es_es: No se puede cargar el informe.
hi_in: रिपोर्ट लोड करने में असमर्थ.
zh_cn: 无法加载报告。

source: Unable to load role.
es_es: No se puede cargar el rol.
hi_in: भूमिका लोड करने में असमर्थ।
zh_cn: 无法加载角色。

source: Unable to load user.
es_es: No se puede cargar el usuario.
hi_in: उपयोगकर्ता लोड करने में असमर्थ।
zh_cn: 无法加载用户。

source: Unable to update static user.
es_es: No se puede actualizar el usuario estático.
hi_in: स्थिर उपयोगकर्ता को अपडेट करने में असमर्थ।
zh_cn: 无法更新静态用户。

# Unexpected_error_occurred_deleting_user_with_Id
source: Unexpected error occurred deleting user with ID '{0}'.
es_es: Se ha producido un error inesperado al eliminar el usuario con id '{0}'.
hi_in: अप्रत्याशित त्रुटि आईडी '{0}' के साथ उपयोगकर्ता को हटाने हुई।
zh_cn: 意外错误发生时，删除用户 ID"{0}"。

# Unexpected_error_occurred_disabling_2FA
source: Unexpected error occurred disabling Two-Factor Authentication for user with ID '{0}'.
es_es: Se ha producido un error inesperado al deshabilitar la autenticación de dos factores para el usuario con ID '{0}'.
hi_in: अप्रत्याशित त्रुटि आईडी '{0}' के साथ उपयोगकर्ता के लिए दो कारक प्रमाणीकरण अक्षम हुई।
zh_cn: 意外错误发生在具有 ID"{0}"的用户禁用双重身份验证时。

source: Username has been confirmed successfully.
es_es: El nombre de usuario se ha confirmado correctamente.
hi_in: उपयोगकर्ता नाम की सफलतापूर्वक पुष्टि की गई है।
zh_cn: 用户名已确认成功。

# Username_is_already_taken
source: Username '{0}' is already taken.
es_es: El nombre de usuario '{0}' ya está tomado.
hi_in: उपयोगकर्ता नाम '{0}' पहले से ही लिया जाता है।
zh_cn: 用户名"{0}"已被获取。

# Username_is_invalid
source: Username '{0}' is invalid, can only contain letters or digits.
es_es: El nombre de usuario '{0}' no es válido, solo puede contener letras o dígitos.
hi_in: उपयोगकर्ता नाम '{0}' अमान्य है, केवल अक्षर या अंक हो सकते हैं।
zh_cn: 用户名"{0}"无效，只能包含字母或数字。

source: Username is required.
es_es: Se requiere nombre de usuario.
hi_in: उपयोगकर्ता नाम की आवश्यकता है।
zh_cn: 需要用户名。

source: Username must be at least 6 characters.
es_es: El nombre de usuario debe tener al menos 6 caracteres.
hi_in: उपयोगकर्ता नाम कम से कम 6 वर्ण होना चाहिए।
zh_cn: 用户名必须至少为 6 个字符。

source: Username must not exceed 200 characters.
es_es: El nombre de usuario no debe exceder los 200 caracteres.
hi_in: उपयोगकर्ता नाम 200 वर्णों से अधिक नहीं होना चाहिए।
zh_cn: 用户名不得超过 200 个字符。

source: User already has a password set.
es_es: El usuario ya tiene una contraseña establecida.
hi_in: यूजर के पास पहले से ही पासवर्ड सेट है।
zh_cn: 用户已经有一个密码集。

# User_already_in_role
source: User already in role '{0}'.
es_es: Usuario que ya está en el rol '{0}'.
hi_in: उपयोगकर्ता पहले से ही '{0}' की भूमिका में हैं।
zh_cn: 用户已经在角色"{0}"。

source: User has been added without files.
es_es: El usuario se ha agregado sin archivos.
hi_in: उपयोगकर्ता फ़ाइलों के बिना जोड़ा गया है।
zh_cn: 用户已添加而没有文件。

source: User has been created successfully.
es_es: El usuario se ha creado correctamente.
hi_in: उपयोगकर्ता सफलतापूर्वक बनाया गया है।
zh_cn: 用户已创建成功。

source: User has been deleted successfully.
es_es: El usuario se ha eliminado correctamente.
hi_in: उपयोगकर्ता को सफलतापूर्वक हटा दिया गया है।
zh_cn: 用户已成功删除。

source: User has been updated successfully.
es_es: El usuario se ha actualizado correctamente.
hi_in: उपयोगकर्ता को सफलतापूर्वक अपडेट किया गया है।
zh_cn: 用户已成功更新。
